src/Reports/МониторПроизводительностиПлатформы/МониторПроизводительностиПлатформы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>МониторПроизводительностиПлатформы</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильКлючевыхОпераций</name>
    <type>
      <types>CatalogRef.ПрофилиКлючевыхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоКлючевыеОперацииПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБазовоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоБазДляРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоРелизныеПлатформы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоРелизныеВерсииКонфигураций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыИнформационнойБазы</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
</mdclass:Report>

src/Reports/МониторПроизводительностиПлатформы/Forms/ФормаНастройкиОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Отчет.Период = ЭтотОбъект.Параметры.Период;
    Отчет.ПрофильКлючевыхОпераций = ЭтотОбъект.Параметры.ПрофильКлючевыхОпераций;
    Отчет.ТолькоКлючевыеОперацииПрофиля = ЭтотОбъект.Параметры.ТолькоКлючевыеОперацииПрофиля;
    Отчет.ИспользоватьБазовоеЗначение = ЭтотОбъект.Параметры.ИспользоватьБазовоеЗначение;
    Отчет.МинимальноеКоличествоБазДляРаспределения = ЭтотОбъект.Параметры.МинимальноеКоличествоБазДляРаспределения;
    Отчет.ТипАнализа = ЭтотОбъект.Параметры.ТипАнализа;
	Отчет.ТолькоРелизныеПлатформы = ЭтотОбъект.Параметры.ТолькоРелизныеПлатформы;
	Отчет.ТолькоРелизныеВерсииКонфигураций = ЭтотОбъект.Параметры.ТолькоРелизныеВерсииКонфигураций;
	СтатусыИнформационнойБазы.ЗагрузитьЗначения(ЭтотОбъект.Параметры.СтатусыИнформационнойБазы);
    
    Если Отчет.ТипАнализа = "APDEX" Тогда
        ЭтотОбъект.Элементы.ИспользоватьБазовоеЗначение.Доступность = Истина;
    Иначе
        ЭтотОбъект.Элементы.ИспользоватьБазовоеЗначение.Доступность = Ложь;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипАнализаПриИзменении(Элемент)
    
    Если Отчет.ТипАнализа = "APDEX" Тогда
        ЭтотОбъект.Элементы.ИспользоватьБазовоеЗначение.Доступность = Истина;
    Иначе
        ЭтотОбъект.Элементы.ИспользоватьБазовоеЗначение.Доступность = Ложь;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
    
    ПараметрыЗакрытия = Новый Структура;
    ПараметрыЗакрытия.Вставить("Период", Отчет.Период);
    ПараметрыЗакрытия.Вставить("ПрофильКлючевыхОпераций", Отчет.ПрофильКлючевыхОпераций);
    ПараметрыЗакрытия.Вставить("ТолькоКлючевыеОперацииПрофиля", Отчет.ТолькоКлючевыеОперацииПрофиля);
    ПараметрыЗакрытия.Вставить("ИспользоватьБазовоеЗначение", Отчет.ИспользоватьБазовоеЗначение);
    ПараметрыЗакрытия.Вставить("МинимальноеКоличествоБазДляРаспределения", Отчет.МинимальноеКоличествоБазДляРаспределения);
    ПараметрыЗакрытия.Вставить("ТипАнализа", Отчет.ТипАнализа);
	ПараметрыЗакрытия.Вставить("ТолькоРелизныеПлатформы", Отчет.ТолькоРелизныеПлатформы);
	ПараметрыЗакрытия.Вставить("ТолькоРелизныеВерсииКонфигураций", Отчет.ТолькоРелизныеВерсииКонфигураций);
	ПараметрыЗакрытия.Вставить("СтатусыИнформационнойБазы", СтатусыИнформационнойБазы.ВыгрузитьЗначения());
    
    ЭтотОбъект.Закрыть(ПараметрыЗакрытия);
    
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
    ЭтотОбъект.Закрыть();
КонецПроцедуры

#КонецОбласти
